documentation reorg
